000001 ID DIVISION.
000002 PROGRAM-ID. ALTURA.
000003
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 Q PIC 9(3).
000007 01 ALTURA PIC 9(3)V99.
000008 01 I PIC 9(3) VALUE 1.
000009 01 M PIC 9(4)9V99.
000010 01 MEDIA PIC 9(3)V99.
000011 PROCEDURE DIVISION.
000012 DISPLAY "NUMERO DE PESSOAS PARA LER ALTURA"
000013 ACCEPT Q
000014 PERFORM UNTIL I > Q
000015     DISPLAY "ALTURA " I
000016     ACCEPT ALTURA
000017     ADD ALTURA TO M
000018     ADD 1 TO I
000019 END-PERFORM
000020 COMPUTE MEDIA = M/Q
000021 DISPLAY "MEDIA = " MEDIA
000022 STOP RUN.
