     IDENTIFICATION DIVISION.
	       PROGRAM-ID AREA.

           DATA DIVISION.
.
	       WORKING-STORAGE SECTION.
	       01 BMENOR PIC 99V99.
	       01 BMAIOR PIC 99V99.
	       01 ALTURA PIC 99V99.
	       01 AREATRA PIC 99V99.

	       PROCEDURE DIVISION.
	       DISPLAY "BASE MENOR"
	       ACCEPT BMENOR
	       DISPLAY "BASE MAIOR"
	       ACCEPT BMAIOR
	       DISPLAY "ALTURA"
	       ACCEPT ALTURA

	       COMPUTE AREATRA = ((BMENOR + BMAIOR) * ALTURA) / 2

	       DISPLAY "AREA = " AREATRA
	       STOP RUN.
