000001 IDENTIFICATION DIVISION.
000000 PROGRAM-ID. ATENEGA.
000000
000000 DATA DIVISION.
000000 WORKING-STORAGE SECTION.
000000 01 N PIC S9(3) VALUE 0.
000000 01 SOMA PIC 9(5) VALUE 0.
000000
000000 PROCEDURE DIVISION.
000000 PERFORM UNTIL N < 0
000000    DISPLAY "DIGITE UM INTEIRO, SE FOR MENOR QUE 0 PARA"
000000    ACCEPT N
000000    IF N >= 0
000000      ADD N TO SOMA
000000    END-IF
000000 END-PERFORM
000000 DISPLAY SOMA
000000 STOP RUN.
