000001 ID DIVISION.
000002 PROGRAM-ID. BANCO.
000005*AUTHOR "ANDREFG".
000006
000007 DATA DIVISION.
000008 WORKING-STORAGE SECTION.
000009 77 WS-VALORDIVIDA PIC 9999999V99.
000010 77 WS-EMPRESTIMO PIC 9999999V99.
000011 77 WS-JUROS PIC 999V99.
000012 
000013 PROCEDURE DIVISION.
000014 DISPLAY "QUANTO VC QUER PEGAR EMPRESTADO?"
000015 ACCEPT WS-EMPRESTIMO
000016 DISPLAY "QUAL É A TAXA DE JUROS?"
000017 ACCEPT WS-JUROS
000018 COMPUTE WS-VALORDIVIDA = WS-EMPRESTIMO * WS-JUROS
000019 DISPLAY "APOS PEGAR ESTE DINHEIRO VC VAI PAGAR " WS-VALORDIVIDA
000020 STOP RUN.
