	IDENTIFICATION DIVISION.
	  PROGRAM-ID. BISESTO.

	DATA DIVISION.
	  WORKING-STORAGE SECTION.
	  01 ANO PIC 9(4).

	PROCEDURE DIVISION.
	  DISPLAY "ANO: "
	  ACCEPT ANO
	  IF (FUNCTION MOD(ANO, 4) = 0 AND FUNCTION MOD(ANO, 100) <> 0) OR FUNCTION MOD(ANO, 400) = 0
	      DISPLAY "É BISESTO"
	  ELSE
	      DISPLAY "NÃO É"
	  END-IF.
	  STOP RUN.
