	 IDENTIFICATION DIVISION.
	 PROGRAM-ID. BOI.

	 DATA DIVISION.
	 WORKING-STORAGE SECTION.
	 01 PINI PIC 9999V9.
	 01 ENGORDA PIC 9(3).
	 01 FINA PIC 9999V9.

	  PROCEDURE DIVISION.
	   DISPLAY "PESO "
	   ACCEPT PINI
	   DISPLAY "ENGORDA "
	   ACCEPT ENGORDA
	   COMPUTE FINA = PINI + (PINI * ENGORDA) / 100
	   
	   DISPLAY "PESO FINAL = " FINA
	   
	   STOP RUN.
