	IDENTIFICATION DIVISION.
	PROGRAM-ID. CAVALOS.

	DATA DIVISION.
	WORKING-STORAGE SECTION.
	01 CAVALOS PIC 9(4).
	01 PATAS PIC 9(1) VALUE 4.
	01 R PIC 9(6).

	PROCEDURE DIVISION.
		DISPLAY "QUANTOS CAVALOS O SENHOR COMPROU?"
		ACCEPT CAVALOS
		COMPUTE R = CAVALOS * PATAS
		DISPLAY "FERRADURAS = " R
		STOP RUN.
