	  IDENTIFICATION DIVISION.
	  PROGRAM-ID. COMBUSTIVEL.

	  DATA DIVISION.
	  WORKING-STORAGE SECTION.
	    01 ETANOL PIC 99V99.
	    01 GASOLINA PIC 99V99.
	    01 COMBUSTIVEL PIC 99V99.

	  PROCEDURE DIVISION.
	    DISPLAY "ETANOL"
	    ACCEPT ETANOL
	    DISPLAY "GASOLINA"
	    ACCEPT GASOLINA

	    COMPUTE COMBUSTIVEL = (ETANOL * 70) / 100

	    IF COMBUSTIVEL < GASOLINA
	      DISPLAY "USE ETANOL"
	    ELSE
	       DISPLAY "USE GASOLINA"
	    END-IF.
	  STOP RUN.
