	  IDENTIFICATION DIVISION.
	  PROGRAM-ID. DESCONTOCOMPRA.

	  DATA DIVISION.
	    WORKING-STORAGE SECTION.
	    01 COMPRA PIC 99999V99.
	    01 DESCONTO PIC 999V99.
	  PROCEDURE DIVISION.
	    DISPLAY "VALOR DA COMPRA"
	    ACCEPT COMPRA

	    IF COMPRA <= 100
	       DISPLAY "VALOR = " COMPRA
	    ELSE
		IF COMPRA > 100 AND COMPRA <= 500
		    COMPUTE DESCONTO = COMPRA - ((COMPRA * 10) / 100)
		    DISPLAY "VALOR = " DESCONTO
		ELSE
		    COMPUTE DESCONTO = COMPRA - ((COMPRA * 20) / 100) 
		    DISPLAY "VALOR = " DESCONTO
		END-IF
	    END-IF
	    STOP RUN.
