000001 *============================
000002 IDENTIFICATION DIVISION.
000003 *============================
000004 
000005 PROGRAM-ID. CFPPT001.
000006 *AUTHOR. ANDRE COSTA.
000007 *DATE-WRITTEN. 01/10/2020.
000008 *DATE-COMPILED. 02/10/2020.
000009 *SECURITY: EXEMPLO DE LEITURA DE ARQUIVO.
000010 
000011 *============================
000012 ENVIRONMENT DIVISION.
000013 *===========================
000014 
000015 CONFIGURATION SECTION.
000016 
000017 SPECIAL-NAMES.
000018     DECIMAL-POINT IS COMMA.
000019 
000020 INPUT-OUTPUT SECTION.
000021 
000022 FILE-CONTROL.
000023     SELECT CFP001E1 ASSIGN TO 'entrada.dat'
000024         ORGANIZATION IS LINE SEQUENTIAL.
000025     SELECT CFP002S2 ASSIGN TO 'saida.dat'
000026         ORGANIZATION IS LINE SEQUENTIAL.
000027 
000028 DATA DIVISION.
000029 
000030 FILE SECTION.
000031 
000032 FD CFP001E1.
000033 01 CFP001E1-REG                     PIC X(064).
000034 
000035 FD CFP002S2.
000036 01 CFP002S2-REG                     PIC X(080).
000037 
000038 WORKING-STORAGE SECTION.
000039 
000040 77 CNT-LIDOS                         PIC 9(7) VALUE ZEROS.
000041 77 CNT-DET-GRVDS                     PIC 9(7) VALUE ZEROS.
000042 77 CNT-APROVADOS                     PIC 9(7) VALUE ZEROS.
000043 77 CNT-REPROVADOS                    PIC 9(7) VALUE ZEROS.
000044 77 GDA-MEDIA                         PIC 9(4)V99 VALUE ZEROS.
000045 77 MATR-ANT                          PIC S9(9) COMP VALUE ZEROS.
000046 77 MASCARA-LIDOS                     PIC ZZZ.ZZZ.ZZ9 VALUE ZEROS.
000047 77 MASCARA-GRVDS                     PIC ZZZ.ZZZ.ZZ9 VALUE ZEROS.
000048 77 IN-FIM-CFP001E1                   PIC 9 VALUE 0.
000049     88 FIM-CFP001E1                  VALUE 1.
000050 
000051 01 DATA-SISTEMA.
000052     03 ANO-SISTEMA                   PIC 9(4).
000053     03 MES-SISTEMA                   PIC 9(2).
000054     03 DIA-SISTEMA                   PIC 9(2).
000055 
000056 01 DATA-SISTEMA-F.
000057     03 DIA-SISTEMA-F                 PIC 9(2).
000058     03 FILLER                        PIC X VALUE "/".
000059     03 MES-SISTEMA-F                 PIC 9(2).
000060     03 FILLER                        PIC X VALUE "/".
000061     03 ANO-SISTEMA-F                 PIC 9(4).
000062 
000063 01 HORA-SISTEMA.
000064     03 HORA                          PIC 9(2).
000065     03 MINUTOS                       PIC 9(2).
000066     03 SEGUNDOS                      PIC 9(2).
000067 
000068 01 HORA-SISTEMA-F.
000069     03 HH-SISTEMA-F                  PIC 9(2).
000070     03 FILLER                        PIC X VALUE ":".
000071     03 MM-SISTEMA-F                  PIC 9(2).
000072     03 FILLER                        PIC X VALUE ":".
000073     03 SS-SISTEMA-F                  PIC 9(2).
000074 
000075 * Dados fictícios para simulação de registros
000076 01 FD003-GR-ARQUIVO.
000077     05 FD003-TP-REGISTRO             PIC 9(1).
000078     05 FD003-NU-MATRICULA            PIC 9(7).
000079     05 FD003-NO-ALUNO                PIC X(30).
000080     05 FD003-NO-MATERIA              PIC X(20).
000081     05 FD003-VR-NOTA1                PIC 9(2)V9(1).
000082     05 FD003-VR-NOTA2                PIC 9(2)V9(1).
000083     05 FD003-VR-NOTA3                PIC 9(2)V9(1).
000084     05 FD003-VR-NOTA4                PIC 9(2)V9(1).
000085 
000086 01 FD004-GR-DET01.
000087     05 FD004-NO-MATERIA              PIC X(20).
000088     05 FD004-VR-NOTA1                PIC 9(2)V9(1).
000089     05 FD004-VR-NOTA2                PIC 9(2)V9(1).
000090     05 FD004-VR-NOTA3                PIC 9(2)V9(1).
000091     05 FD004-VR-NOTA4                PIC 9(2)V9(1).
000092     05 FD004-VR-MEDIA-F              PIC 9(2)V9(1).
000093     05 FD004-TP-SITUACAO             PIC X(10).
000094 
000095 PROCEDURE DIVISION.
000096 
000097 0000-ROTINA-PRINCIPAL.
000098     DISPLAY 'CFPPT001 - INICIO DE PROCESSAMENTO.'
000099     PERFORM 0010-RECEBER-DATA-HORA-SIST
000100     PERFORM 0020-ABRIR-ARQUIVOS
000101     PERFORM 0030-LER-CFP001E1
000102     PERFORM UNTIL FIM-CFP001E1
000103         PERFORM 0040-PROCESSAR-REGISTROS
000104         PERFORM 0030-LER-CFP001E1
000105     END-PERFORM
000106     PERFORM 0050-FECHAR-ARQUIVOS
000107     PERFORM 0060-RELATORIO-PROCESSAMENTO
000108     DISPLAY 'CFPPT001 - FIM NORMAL DE PROCESSAMENTO.'
000109     GOBACK.
000110 
000111 0010-RECEBER-DATA-HORA-SIST.
000112     ACCEPT DATA-SISTEMA FROM DATE YYYYMMDD
000113     ACCEPT HORA-SISTEMA FROM TIME
000114     MOVE DIA-SISTEMA TO DIA-SISTEMA-F
000115     MOVE MES-SISTEMA TO MES-SISTEMA-F
000116     MOVE ANO-SISTEMA TO ANO-SISTEMA-F
000117     MOVE HORA TO HH-SISTEMA-F
000118     MOVE MINUTOS TO MM-SISTEMA-F
000119     MOVE SEGUNDOS TO SS-SISTEMA-F
000120     EXIT.
000121 
000122 0020-ABRIR-ARQUIVOS.
000123     OPEN INPUT CFP001E1
000124     OPEN OUTPUT CFP002S2
000125     EXIT.
000126 
000127 0030-LER-CFP001E1.
000128     READ CFP001E1 INTO FD003-GR-ARQUIVO
000129         AT END
000130             SET FIM-CFP001E1 TO TRUE
000131         NOT AT END
000132             ADD 1 TO CNT-LIDOS
000133     END-READ
000134     EXIT.
000135 
000136 0040-PROCESSAR-REGISTROS.
000137     IF FD003-TP-REGISTRO = 2
000138         MOVE FD003-NO-MATERIA TO FD004-NO-MATERIA
000139         MOVE FD003-VR-NOTA1 TO FD004-VR-NOTA1
000140         MOVE FD003-VR-NOTA2 TO FD004-VR-NOTA2
000141         MOVE FD003-VR-NOTA3 TO FD004-VR-NOTA3
000142         MOVE FD003-VR-NOTA4 TO FD004-VR-NOTA4
000143         COMPUTE GDA-MEDIA = (FD003-VR-NOTA1*1 +
000144                              FD003-VR-NOTA2*2 +
000145                              FD003-VR-NOTA3*3 +
000146                              FD003-VR-NOTA4*4) / 10
000147         MOVE GDA-MEDIA TO FD004-VR-MEDIA-F
000148         IF GDA-MEDIA >= 7
000149             MOVE 'APROVADO' TO FD004-TP-SITUACAO
000150             ADD 1 TO CNT-APROVADOS
000151         ELSE
000152             MOVE 'REPROVADO' TO FD004-TP-SITUACAO
000153             ADD 1 TO CNT-REPROVADOS
000154         END-IF
000155         WRITE CFP002S2-REG FROM FD004-GR-DET01
000156         ADD 1 TO CNT-DET-GRVDS
000157     END-IF
000158     EXIT.
000159 
000160 0050-FECHAR-ARQUIVOS.
000161     CLOSE CFP001E1 CFP002S2
000162     EXIT.
000163 
000164 0060-RELATORIO-PROCESSAMENTO.
000165     MOVE CNT-LIDOS TO MASCARA-LIDOS
000166     MOVE CNT-DET-GRVDS TO MASCARA-GRVDS
000167     DISPLAY 'TOTAL DE REGISTROS LIDOS    = ' MASCARA-LIDOS
000168     DISPLAY 'TOTAL DE REGISTROS GRAVADOS = ' MASCARA-GRVDS
000169     EXIT.
