000001 ID DIVISION.
000002 PROGRAM-ID. FIBONACCI.
000003
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 N PIC 9(3).
000007 01 I PIC 9(3) VALUE 1.
000008 01 F PIC 9(18).
000009 01 NA PIC 9(18) VALUE 1.
000010 01 NB PIC 9(18) VALUE 0.
000011 PROCEDURE DIVISION.
000012 DISPLAY "DIGITE UM NUMERO"
000013 ACCEPT N
000014 IF N < 50 OR N > 100
000015    STOP RUN
000016 END-IF
000017 DISPLAY NB
000018 DISPLAY NA
000017 PERFORM UNTIL I > N
000018     COMPUTE F = NA + NB
000019     MOVE NA TO NB
000020     MOVE F TO NA
000021     DISPLAY F
000022     ADD 1 TO I
000023 END-PERFORM
000024 STOP RUN. 
