000001 ID DIVISION.
000002 PROGRAM-ID. FUNCIONARIOS.
000003
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 EXEC SQL INCLUDE SQLCA END-EXEC.
000007
000008 77 NOME PIC X(50).
000009 77 SALARIO PIC 9(5)V99.
000010
000011 PROCEEDURE DIVISION.
000012 BEGIN.
000013     EXEC SQL.
000014        CONNECT TO 'EMPRESA' USER 'root' IDENTIFIED BY 'SUA SENHA'
000015     END-EXEC.
000016
000017     DISPLAY "DIGITE SEU NOME"
000018     ACCEPT NOME
000019     DISPLAY "SEU SALARIO"
000020     ACCEPT SALARIO
000021
000022     EXEC SQL
000023        INSERT INTO FUNCIOONARIOS (NOME, SALARIO)
000024        VALUES (:NOME, :SALARIO)
000025     END-EXEC.
000026
000027     DISPLAY "INSERÇÃO REALIZADA"
000028
000029     EXEC SQL COMMIT END-EXEC.
000030     STOP RUN.          
