       IDENTIFICATION DIVISION.
       PROGRAM-ID. GASOSA.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 VALOR PIC 999V99.
       01 DINHEIRO PIC 999V99.
       01 LITROS PIC 999V99.

       PROCEDURE DIVISION.
	DISPLAY "VALOR DO LITRO: "
	ACCEPT VALOR
	DISPLAY "DINEHIRO GASTO: "
	ACCEPT DINHEIRO
	COMPUTE LITROS = DINHEIRO / VALOR
	DISPLAY "LITROS = " LITROS
	STOP RUN.
