	   IDENTIFICATION DIVISION.
	   PROGRAM-ID. GEANYFILME.
	  
	   DATA DIVISION.
	   WORKING-STORAGE SECTION.
	   01 IDADE PIC 9(3).
	  
	   PROCEDURE DIVISION.
	   DISPLAY "QUAL É A SUA IDADE"
	   ACCEPT IDADE
	  
	   IF IDADE <= 10
		 DISPLAY "INFANTIL"
	   ELSE
		   IF IDADE >= 11 AND IDADE <= 14
			 DISPLAY "INFANTO JUVENIL" 
		   ELSE
		       IF IDADE >=15 AND IDADE <= 17
		         DISPLAY "JUVENIL"
		       ELSE
		           DISPLAY "ADULTO"
		        END-IF   
		   END-IF     
	   END-IF
	   STOP RUN.
