	IDENTIFICATION DIVISION.
        PROGRAM-ID. idade.

        DATA DIVISION.
        WORKING-STORAGE SECTION.
        01 ANOS PIC 9(2).
        01 MESES PIC 9(4).
        01 DIAS PIC 9(7).

        PROCEDURE DIVISION.
		DISPLAY "ESCREVA A SUA IDADE EM ANOS:"
		ACCEPT ANOS
		COMPUTE MESES = ANOS * 12
		COMPUTE DIAS = MESES * 30
		DISPLAY "ANOS: " ANOS
		DISPLAY "MESES: " MESES
		DISPLAY "DIAS: "DIAS
		STOP RUN.
