000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. LERNOME.
000003
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 WS-NOME PIC X(10).
000007
000008 PROCEDURE DIVISION.
000009   DISPLAY "DIGITE O SEU NOME: "
000010   ACCEPT WS-NOME
000011   DISPLAY "OI " WS-NOME"!"
000012   STOP RUN.
