000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. MAIOREMENOR.
000003
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006   01 MAIOR PIC 9(4).
000007   01 MENOR PIC 9(4) VALUE 1.
000008   01 I PIC 9(2) VALUE 1.
000009   01 A PIC 9(3).
000010
000011 PROCEDURE DIVISION.
000012 PERFORM UNTIL I > 10
000013    DISPLAY "DIGITE UM NUMERO INTEIRO +"
000014    ACCEPT A     
000015    IF A > MAIOR
000016      MOVE A TO MAIOR
000017    ELSE
000018       IF A < MENOR
000019         MOVE A TO MENOR
000020       END-IF
000021    END-IF
000022    ADD 1 TO I
000023 END-PERFORM
000024 DISPLAY "MAIOR = " MAIOR " MENOR = " MENOR
000025 STOP RUN.     
