	IDENTIFICATION DIVISION.
	PROGRAM-ID. MAIOR.
	  
	DATA DIVISION.
	WORKING-STORAGE SECTION.
	  01 UM PIC 9(3).
	  01 DOIS PIC 9(3).
	  01 TRES PIC 9(3).
	  
	PROCEDURE DIVISION.
	DISPLAY "N 1"
	ACCEPT UM
	DISPLAY "N  2"
	ACCEPT DOIS
	DISPLAY "N 3"
	ACCEPT TRES
	IF UM >= DOIS AND UM >= TRES
	   DISPLAY "UM É MAIOR"
	ELSE
	    IF DOIS >= UM AND DOIS >= TRES 
		DISPLAY "DOIS É MAIOR"
	    ELSE 
		DISPLAY "TRES É MAIOR"
	    END-IF
	END-IF
	STOP RUN.
