000001 ID DIVISION.
000002 PROGRAM-ID. MEDIA.
000003
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 77 WS-N PIC 9(3).
000007 77 WS-I PIC 9(3) VALUE 1.
000008 77 WS-MEDIA PIC 9(3) VALUE 0.
000009 77 WS-Q PIC 9(3).
000010 77 WS-J PIC 9(3).
000011
000012 PROCEDURE DIVISION.
000013 DISPLAY "DIGA A QUANTIDADE DE NUMEROS QUE SERAO INSEIDOS"
000014 ACCEPT WS-Q
000015 PERFORM UNTIL WS-I > WS-Q
000016 DISPLAY "DIGITE O NUMERO " WS-I
000017 ACCEPT WS-N
000018 ADD WS-N TO WS-J
000019 ADD 1 TO WS-I
000020 END-PERFORM
000022 COMPUTE WS-MEDIA = WS-J / WS-Q
000023 DISPLAY "A MEDIA É = " WS-MEDIA
000024 STOP RUN.
