	 IDENTIFICATION DIVISION.
	 PROGRAM-ID. TESTEDONOTEPAD.
	  
	 DATA DIVISION.
	 WORKING-STORAGE SECTION.
	 01 ANO PIC 9(4) VALUE "2025".
	  
	 PROCEDURE DIVISION.
	  DISPLAY "-" ANO
	  STOP RUN.
