	IDENTIFICATION DIVISION.
	PROGRAM-ID. PESO.

	DATA DIVISION.
	WORKING-STORAGE SECTION.
	  01 QUILO PIC 999V99.
	  01 GRAMA PIC 999999V99.

	PROCEDURE DIVISION.
	  DISPLAY "PESO EM KG: "
	  ACCEPT QUILO
	  COMPUTE GRAMA = QUILO * 1000
	  DISPLAY "PESO EM GRAMA = " GRAMA
	  STOP RUN.
