000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. POTENCIA.
000003 
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006   01 N PIC 9(3).
000007   01 V PIC 9(3).
000008   01 I PIC 9(3) VALUE 1.
000009   01 RCAL PIC 9(10) VALUE 1.
000010   01 R PIC Z(10) .
000011 PROCEDURE DIVISION.
000012 DISPLAY "QUAL NUMERO DESEJA SABER A POTENCIA?"
000013 ACCEPT N
000014 DISPLAY "ATE QUAL POTENCIA?"
000015 ACCEPT V
000016 DISPLAY N "^ 0 = 1"
000017 PERFORM UNTIL I > V
000018    COMPUTE RCAL = RCAL * N
000019    MOVE RCAL TO R
000020    DISPLAY N "^" I "=" R
000021    ADD 1 TO I
000022 END-PERFORM.
000023 STOP RUN.
