000001 ID DIVISION.
000002 PROGRAM-ID. RANDOM.
000003
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 PALPITE PIC 99 VALUE 0.
000007 01 FUN-RANDOM PIC 9V9(9).
000008 01 I PIC 9(3) VALUE 0.
000009 01 RANDON PIC 99.
000010 
000011 PROCEDURE DIVISION.
000012 COMPUTE FUN-RANDOM = FUNCTION RANDOM
000013 COMPUTE RANDON =  FUNCTION INTEGER (FUN-RANDOM * 11)
000014 PERFORM UNTIL PALPITE EQUAl RANDON
000015     DISPLAY "DIGITE O PALPITE"
000016     ACCEPT PALPITE
000017     ADD 1 TO I
000018     IF PALPITE < RANDON
000019       DISPLAY "PALPITE MUITO BAIXO"
000020     ELSE
000021        IF PALPITE > RANDON
000022          DISPLAY "PALPITE MUITO ALTO"
000023        ELSE
000024           IF PALPITE = RANDON
000025             DISPLAY "PALPITE CORRETO APOS " I "TENTATIVAS"
000026           END-IF
000027        END-IF
000028     END-IF
000029 END-PERFORM
000030 STOP RUN.   
