       IDENTIFICATION DIVISION.
       PROGRAM-ID. SALARIO.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 SFIXO PIC 9999V99.
       01 VVENDAS PIC 9999V99.
       01 PORCENTO PIC 9(3).
       01 FI PIC 9999V99.

       PROCEDURE DIVISION.
	       DISPLAY "SALARIO FIXO"
	       ACCEPT SFIXO
	       DISPLAY "VALOR VENDAS"
	       ACCEPT VVENDAS
	       DISPLAY "PORCENTAGEM"
	       ACCEPT PORCENTO

	       COMPUTE FI = SFIXO + ((VVENDAS * PORCENTO) / 100)

     	   DISPLAY "SALARIO FINAL = " FI
	       STOP RUN.
