000001 ID DIVISION.
000002 PROGRAM-ID. LERPARIM.
000003
000004 DATA DIVISION.
000005 WORKING-STORAGE SECTION.
000006 01 N PIC 9(3).
000007 01 PAR PIC 9(6).
000008 01 IMPAR PIC 9(6).
000009 01 I PIC 9(3) VALUE 1.
000010
000011 PROCEDURE DIVISION.
000012 DISPLAY "DIGITE UM NUMERO"
000013 ACCEPT N
000014 PERFORM UNTIL I > N
000015    IF FUNCTION MOD(I, 2) = 0
000016      ADD I TO PAR
000017      ELSE 
000018          ADD I TO IMPAR
000019    END-IF
000020 ADD 1 TO I
000021 END-PERFORM
000022 DISPLAY "PAR = " PAR " IMPAR = " IMPAR
000023 STOP RUN.
