	IDENTIFICATION DIVISION.
	PROGRAM-ID. TRIANGULO.

	DATA DIVISION.
	WORKING-STORAGE SECTION.
		01 BASE PIC 9(3).
		01 ALTURA PIC 9(3).
		01 AREA-DO-TRIANGULO PIC 9(5)v9(2). *> float com 2 casas de precisao

	PROCEDURE DIVISION.
		DISPLAY "BASE: "
		ACCEPT BASE
		DISPLAY "ALTURA"
		ACCEPT ALTURA
		COMPUTE AREA-DO-TRIANGULO = (BASE * ALTURA)/2
		DISPLAY "AREA: " AREA-DO-TRIANGULO
		STOP RUN.
