	  IDENTIFICATION DIVISION.
	  PROGRAM-ID. VEICULO.

	  DATA DIVISION.
	  WORKING-STORAGE section.
	  01 HORAS PIC 9(3).
	  01 VALOR PIC 9(5).

	  PROCEDURE DIVISION.
	    DISPLAY "HORAS"
	    ACCEPT HORAS
	    IF HORAS <= 2
	       COMPUTE VALOR = HORAS * 2
	       DISPLAY "VALOR = " VALOR
	    ELSE  
		COMPUTE VALOR = 4 + (HORAS - 2)
		DISPLAY "VALOR = " VALOR
	    END-IF.
	  STOP RUN.
