	   IDENTIFICATION DIVISION.
	   PROGRAM-ID. VOGAL.
	   
	   DATA DIVISION.
	   WORKING-STORAGE SECTION.
	   01 LETRA PIC A(1).
	   
	   PROCEDURE DIVISION.
	   DISPLAY "DIGITE UMA LETRA"
	   ACCEPT LETRA
	   IF LETRA  = "A" OR LETRA  = "E" OR LETRA = "I" 
			OR LETRA  = "U" OR LETRA = "O"
		DISPLAY "VOGAL"
	   ELSE
		DISPLAY "CONSOANTE"
	   END-IF.
           STOP RUN.
